// Напишите программу, которая на вход принимает два числа
//и выдаёт, какое число большее, а какое меньшее.
int a;
int b;

Console.WriteLine("Введите первое число");

 a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите второе число");

 b = Convert.ToInt32(Console.ReadLine());

 if(a>b)
 {
    
    object? а = null;
    Console.WriteLine("{0} наибольшое число", а);
 }
 else
 {
   Console.WriteLine("{0} наибольшое число", b); 
 }
 